---
kind: property
id: P:Autodesk.Revit.DB.Electrical.CableTraySettings.SizeSuffix
source: html/bebb05c1-f8a7-6b75-e922-76a97ada427d.htm
---
# Autodesk.Revit.DB.Electrical.CableTraySettings.SizeSuffix Property

The cable tray size suffix string.

## Syntax (C#)
```csharp
public string SizeSuffix { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null